src/cf/Documents/_ДемоРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>_ДемоРеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document._ДемоПоступлениеТоваров</xr:Item>
				<xr:Item>Document._ДемоСчетНаОплатуПокупателю</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._ДемоОстаткиТоваровВМестахХранения</xr:Item>
				<xr:Item>AccountingRegister._ДемоОсновной</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоПоступлениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючАналитики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоКлючиАналитикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоСчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccountingRegisters/_ДемоОсновной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccountingRegister>
		<Properties>
			<Name>_ДемоОсновной</Name>
			<ChartOfAccounts>ChartOfAccounts._ДемоОсновной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts._ДемоОсновной.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/_ДемоОстаткиТоваровВМестахХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>_ДемоОстаткиТоваровВМестахХранения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/_ДемоОборотыПоСчетамНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>_ДемоОборотыПоСчетамНаОплату</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/_ДемоРеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>_ДемоРеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ДемоСтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтраженияВУчете</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ДемоХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, оформившее документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ДемоРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоСчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоОтпускаСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоРеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоСписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef._ДемоСписаниеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительЗаписи</Name>
					<Comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/_ДемоВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>_ДемоВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/_ДемоКлючиАналитикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>_ДемоКлючиАналитикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/_ДемоРеализацияТоваров/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		_ДемоСтандартныеПодсистемы.ПриВводеНовогоЗаполнитьОрганизацию(ЭтотОбъект, "ГоловнаяОрганизация");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ДемоПоступлениеТоваров") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,Дата,Ответственный,Комментарий");
		ГоловнаяОрганизация = ДанныеЗаполнения.Организация;
		Ответственный = Пользователи.ТекущийПользователь();
		Для Каждого СтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
			НоваяСтрока.ДокументПоступления = ДанныеЗаполнения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияПоМестамХранения();
	
	СформироватьБухгалтерскиеДвижения();
	
	СформироватьДвиженияВРеестрДокументов();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "А";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТовары Из Товары Цикл
	
		Если Не ЗначениеЗаполнено(СтрокаТовары.КлючАналитики) Тогда
			ПараметрыКлюча = Новый Структура("Номенклатура, МестоХранения", СтрокаТовары.Номенклатура, МестоХранения);
			СтрокаТовары.КлючАналитики = Справочники._ДемоКлючиАналитикиНоменклатуры.СоздатьКлюч(ПараметрыКлюча);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//

Процедура СформироватьДвиженияПоМестамХранения()
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрБухгалтерии._ДемоОсновной");    
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;                              
	ЭлементБлокировки.УстановитьЗначение("Организация", ГоловнаяОрганизация);
	БлокировкаДанных.Заблокировать();
	
	Массив = Новый Массив;
	Для Сч = 1 По 1000000 Цикл          
		Массив.Добавить(ГоловнаяОрганизация);
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрБухгалтерии._ДемоОсновной");    
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;                              
		ЭлементБлокировки.УстановитьЗначение("Организация", ГоловнаяОрганизация);
	КонецЦикла;
	БлокировкаДанных.Заблокировать();                               
	
	КонтрольОстатков();
	
	Движения._ДемоОстаткиТоваровВМестахХранения.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Движение = Движения._ДемоОстаткиТоваровВМестахХранения.Добавить();
		
		Движение.Период        = Дата;
		Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
		
		Движение.Организация   = ГоловнаяОрганизация;
		Движение.МестоХранения = МестоХранения;
		
		Движение.Номенклатура  = СтрокаТовары.Номенклатура;
		Движение.Количество    = СтрокаТовары.Количество;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура КонтрольОстатков()
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления._ДемоОстаткиТоваровВМестахХранения");    
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;                              
	ЭлементБлокировки.УстановитьЗначение("Организация", ГоловнаяОрганизация);
	ЭлементБлокировки.УстановитьЗначение("МестоХранения", МестоХранения);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВложенныйЗапрос.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	                      |	ВложенныйЗапрос.МестоХранения КАК МестоХранения,
	                      |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                      |	ВложенныйЗапрос.Количество КАК Количество,
	                      |	ЕСТЬNULL(_ДемоОстаткиТоваровВМестахХраненияОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	                      |		СУММА(_ДемоРеализацияТоваровТовары.Количество) КАК Количество,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.МестоХранения КАК МестоХранения,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.ПометкаУдаления КАК НоменклатураПометкаУдаления,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.Родитель КАК КлючАналитикиНоменклатураРодитель,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.Родитель КАК КлючАналитикиНоменклатураРодитель1,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.ВидНоменклатуры КАК КлючАналитикиНоменклатураВидНоменклатуры,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.ГруппаДоступа КАК КлючАналитикиНоменклатураГруппаДоступа,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.СтранаПроисхождения КАК КлючАналитикиНоменклатураСтранаПроисхождения,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.Родитель КАК КлючАналитикиМестоХраненияРодитель,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.МОЛ КАК КлючАналитикиМестоХраненияМОЛ,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.Поставщик КАК КлючАналитикиМестоХраненияПоставщик,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.ГруппаДоступа КАК КлючАналитикиМестоХраненияГруппаДоступа,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.ВидПартнера КАК КлючАналитикиМестоХраненияВидПартнера,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.СтранаПроисхождения КАК НоменклатураСтранаПроисхождения,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.СтранаПроисхождения.Наименование КАК НоменклатураСтранаПроисхожденияНаименование,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.Договор.Партнер.ВидПартнера КАК ДоговорПартнерВидПартнера,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.Договор.ВалютаРасчетов.НаименованиеПолное КАК ДоговорВалютаРасчетовНаименованиеПолное
	                      |	ИЗ
	                      |		Документ._ДемоРеализацияТоваров.Товары КАК _ДемоРеализацияТоваровТовары
	                      |	ГДЕ
	                      |		_ДемоРеализацияТоваровТовары.Ссылка = &Ссылка
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.ГоловнаяОрганизация,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.МестоХранения,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.ПометкаУдаления,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.Наименование,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.ВидНоменклатуры,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.Родитель,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.ВидНоменклатуры,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.ГруппаДоступа,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.СтранаПроисхождения,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.Родитель,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.МОЛ,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.Поставщик,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.ГруппаДоступа,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.МестоХранения.ВидПартнера,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.Договор.Партнер.ВидПартнера,
	                      |		_ДемоРеализацияТоваровТовары.Ссылка.Договор.ВалютаРасчетов.НаименованиеПолное,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.СтранаПроисхождения,
	                      |		_ДемоРеализацияТоваровТовары.Номенклатура.СтранаПроисхождения.Наименование,
	                      |		_ДемоРеализацияТоваровТовары.КлючАналитики.Номенклатура.Родитель) КАК ВложенныйЗапрос
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления._ДемоОстаткиТоваровВМестахХранения.Остатки(&Дата, ) КАК _ДемоОстаткиТоваровВМестахХраненияОстатки
	                      |		ПО ВложенныйЗапрос.Номенклатура = _ДемоОстаткиТоваровВМестахХраненияОстатки.Номенклатура");   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                          
		ОстатокПосле = Выборка.КоличествоОстаток - Выборка.Количество;
		Если ОстатокПосле < 0 Тогда                                                                                                                                              
			Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	_ДемоОборотыПоСчетамНаОплатуОбороты.Номенклатура КАК Номенклатура,
		                      |	_ДемоОборотыПоСчетамНаОплатуОбороты.СуммаОборот КАК СуммаОборот
		                      |ИЗ
		                      |	РегистрНакопления._ДемоОборотыПоСчетамНаОплату.Обороты КАК _ДемоОборотыПоСчетамНаОплатуОбороты
		                      |ГДЕ
		                      |	_ДемоОборотыПоСчетамНаОплатуОбороты.Номенклатура = &Номенклатура");
			Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
			ВыборкаОборот = Запрос.Выполнить().Выбрать();
			Сумма = 0;
			Если ВыборкаОборот.Следующий() Тогда
				Сумма = ВыборкаОборот.СуммаОборот;
			КонецЕсли; 
			Сообщить("Недостаточно товара " + Выборка.Номенклатура + " на складе " + Выборка.МестоХранения + " организации " + Выборка.ГоловнаяОрганизация + ": " + ОстатокПосле + " на сумму " + Сумма);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//
Процедура СформироватьДвиженияВРеестрДокументов()
	
	УстановитьПривилегированныйРежим(Истина);

	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	Движение = РегистрыСведений._ДемоРеестрДокументов.СоздатьМенеджерЗаписи();
	Движение.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("Имя",(МетаданныеОбъекта.Имя));
	Движение.Организация = ГоловнаяОрганизация;
	Движение.Партнер = Партнер;
	Движение.МестоХранения = МестоХранения;
	Движение.Контрагент = Контрагент;
	Движение.Подразделение = Подразделение;
	Движение.ДатаДокументаИБ = Дата;
	Движение.Договор = Договор;
	Движение.Ссылка = Ссылка;
	Движение.НомерДокументаИБ = Номер;
	Движение.Ответственный = Ответственный;
	Движение.Комментарий = Комментарий;
	Движение.Проведен = Истина;
	Движение.ПометкаУдаления = Ложь;
	Движение.Дополнительно = НСтр("ru = 'По договору'")+" " + """"+Договор+"""";
	Движение.ДатаПервичногоДокумента = Дата;
	Движение.НомерПервичногоДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Истина) ;
	Движение.Сумма = Товары.Итог("Цена")*Товары.Итог("Количество");
	Движение.Валюта = Валюта;
	Движение.ДатаОтраженияВУчете = Дата;
	Движение.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СформироватьБухгалтерскиеДвижения()
	
	ВалютныйДокумент = Валюта.Код <> "643";
	Если Валюта.Пустая() Тогда
		ВалютаДокумента  = Новый Структура("Курс, Кратность", 1, 1,);
	Иначе
		ВалютаДокумента  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	КонецЕсли;
	
	ОбрабатыватьНДС = ПолучитьФункциональнуюОпцию("_ДемоУчитыватьНДС") И Не ВалютныйДокумент;
	
	Движения._ДемоОсновной.Записывать = Истина;
	
	Для Каждого СтрокаТовара Из Товары Цикл
		
		ДвижениеРеализацииТовара(СтрокаТовара, ВалютныйДокумент, ВалютаДокумента);
		
		Если ОбрабатыватьНДС Тогда
			ДвижениеУчетаНачисленногоНДС(СтрокаТовара);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвижениеРеализацииТовара(Знач СтрокаТовара, Знач ВалютныйУчет, Знач ВалютаДокумента)
		
	ВалютнаяСумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
	РублеваяСумма = ВалютнаяСумма * ВалютаДокумента.Курс / ВалютаДокумента.Кратность;
	
	НоменклатурнаяГруппа = СтрокаТовара.Номенклатура.ВидНоменклатуры;
	
	// ---
	Движение = Движения._ДемоОсновной.Добавить();
	Движение.Период      = Дата;
	Движение.Организация = ГоловнаяОрганизация;
	Движение.Содержание  = НСтр("ru = 'Реализация товаров'");
	Движение.Сумма       = РублеваяСумма;
	
	Если ВалютныйУчет Тогда
		Движение.СчетДт          = ПланыСчетов._ДемоОсновной.РасчетыСПокупателямиВал;
		Движение.ВалютаДт        = Валюта;
		Движение.ВалютнаяСуммаДт = ВалютнаяСумма;
	Иначе
		Движение.СчетДт = ПланыСчетов._ДемоОсновной.РасчетыСПокупателями;
	КонецЕсли;
	
	Движение.СубконтоДт.Контрагенты = Контрагент;
	Движение.СубконтоДт.Договоры    = Договор;
	
	Движение.СчетКт = ПланыСчетов._ДемоОсновной.Выручка;
	Движение.СубконтоКт.НоменклатурныеГруппы = НоменклатурнаяГруппа;
	
	Если Не ВалютныйУчет Тогда
		Движение.СубконтоКт.СтавкиНДС = СтавкаНДС;
	КонецЕсли;
	
	// ---
	Движение = Движения._ДемоОсновной.Добавить();
	Движение.Период      = Дата;
	Движение.Организация = ГоловнаяОрганизация;
	Движение.Содержание  = НСтр("ru = 'Реализация товаров'");
	Движение.Сумма       = РублеваяСумма;
	
	Движение.СчетДт = ПланыСчетов._ДемоОсновной.СебестоимостьПродаж;
	Движение.СубконтоДт.НоменклатурныеГруппы = НоменклатурнаяГруппа;
	
	Движение.СчетКт = ПланыСчетов._ДемоОсновной.ТоварыНаСкладах;
	
	Движение.СубконтоКт.Контрагенты  = Контрагент;
	Движение.СубконтоКт.Номенклатура = СтрокаТовара.Номенклатура;
	Движение.СубконтоКт.Склады       = МестоХранения;
	
	Движение.КоличествоКт = СтрокаТовара.Количество;
	
КонецПроцедуры

Процедура ДвижениеУчетаНачисленногоНДС(Знач СтрокаТовара)
	
	РублеваяСумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
	СуммаНДС = РублеваяСумма / 100 * СтавкаНДС.Ставка;
	
	НоменклатурнаяГруппа = СтрокаТовара.Номенклатура.ВидНоменклатуры;	
	
	Движение = Движения._ДемоОсновной.Добавить();
	Движение.Период      = Дата;
	Движение.Организация = ГоловнаяОрганизация;
	Движение.Сумма       = СуммаНДС;
	
	Движение.СчетДт = ПланыСчетов._ДемоОсновной.Продажи_НДС;
	Движение.СубконтоДт.НоменклатурныеГруппы = НоменклатурнаяГруппа;
	
	Движение.СчетКт = ПланыСчетов._ДемоОсновной.НДС;
	Движение.СубконтоКт.ВидыПлатежейВБюджет = Перечисления._ДемоВидыПлатежейВБюджет.Налог;
	
	Значения = Новый Структура;
	Значения.Вставить("Содержание", "ru = 'Реализация товаров';"); // @НСтр-2
	
	ОбщегоНазначения.УстановитьЗначенияРеквизитов(Движение, Значения);
	
КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
